Repository: Denis13tm/Daily
Catalog: Daily Expense vs Income/*.lproj/Localizable.strings
Languages: uz

# title0
source: Select preferred language
uz: Kerakli tilni tanlang

# description0
source: Please select your preferred language to be used within the app. You can change this setting anytime on the main page.
uz: Iltimos, ilova ichida foydalanish uchun oʻzingizga maʼqul tilni tanlang. Ushbu sozlamani istalgan vaqtda asosiy sahifada o'zgartirishingiz mumkin.

# LangLabel
source: ENG
uz: UZB

# title1
source: Select base currency
uz: Kerakli valyutani tanlang

# description1
source: Let's start by selecting your base currency. All transactions in other currencies will be calculated regards this one.
uz: Keling, kerakli valyutani tanlashdan boshlaylik. Boshqa valyutalardagi barcha operatsiyalar shu tanlangan valyuta bo'yicha amalga oshiriladi.

# currencyLabel
source: USD
uz: SUM

# title2
source: Set up your current cash balance
uz: Hisobingizdagi pul miqdorini kiriting

# description2
source: How much cash do you have in your physical wallet? Insert above to show your actual cash balance on the main page.
uz: Hozirgi hisobingizda qancha naqd pulingiz bor? Asosiy sahifada haqiqiy naqd pul miqdorini ko'rsatish uchun yuqoriga kiritishingizni so'raymiz.

# title3
source: Set up a new password
uz: Parol o'rnating

# errorLabel
source: Passcodes don't match. Please try again.
uz: Parollar mos kelmaydi. Iltimos, yana bir bor urinib ko'ring.

# headline
source: Enter 4 digits password please
uz: Iltimos 4 xonali parolni kiriting

source: Enter password
uz: Parolni kiriting

source: Confirm password
uz: Parolni tasdiqlang

# digits
source: 4 digits
uz: 4 xonali

# description3
source: Set up a new passcode for your privacy and to avoid stealing your financial data.
uz: Maxfiyligingiz va moliyaviy ma'lumotlaringizni xavfsizligini ta'minlash uchun parol o'rnating.

source: Launching...
uz: Boshlanayapdi...

# title4
source: Enter your Cash Flow Passcode
uz: Cash Flow parolini kiriting

# errorL
source: Wrong passcode. Please try again !
uz: Xato parol, Qayta urinib ko'ring!

source: Delete
uz: O'chirish

source: TOTAL BALANCE
uz: UMUMIY BALANSINGIZ

source: Income
uz: Kirim

source: Expense
uz: Chiqim

# expProfit
source: Expecting Profit
uz: Kutilayotgan foyda

# transaction
source: Transactions
uz: O'tkazmalar

# expCost
source: Expecting Cost
uz: Kutilayotgan xarajat

# lastTranLabel
source: Last Transactions
uz: Oxirgi o'tkazmalar

source: View all
uz: Hammasini ko'rish

# todayLabel
source: TODAY
uz: BUGUN

# addNewTranLabel
source: Add New Tranactions
uz: Yangi o'tkazmalar qo'shing

# title5
source: Add Transaction
uz: O'tkazma qo'shish

source: Type:
uz: O'tkazma turi:

# typeLabel
source: Expense ▼
uz: Chiqim ▼

# expenseL
source: Expense
uz: Chiqim

# incomeL
source: Income
uz: Kirim

source: Amount
uz: Pul miqdori

source: Category
uz: Kategoriya

# categoryLabel
source: Entertainment ▼
uz: O'yin-kulgu ▼

source: Date
uz: Sana

source: Set Date ▼
uz: Sanani belgilang ▼

source: Notes:
uz: Eslatma:

# notePlaceholder
source: Enter some notes
uz: Izoh kiriting

source: Error !!!!
uz: Xato !!!!

# saveBtn
source: Save
uz: Saqlash

# title6
source: Transaction
uz: O'tkazma

# title7
source: All Transactions
uz: Barcha O'tkazmalar

# noTran
source: No Transactions Yet
uz: Hali o'tkazma mavjud emas

# title8
source: Profile
uz: Profil

# dailyIncome
source: Daily Incomes
uz: Kunlik Foyda

source: Daily Expenses
uz: Kunlik Xarajat

# totalBalance_CardView
source: TOTAL BALANCE
uz: UMUMIY BALANSINGIZ

source: About
uz: App haqida

# explanation
source: Welcome to your finances manager 'CASH FLOW'. With this app ,firstly, you can easily add your expense and incomes, and also create budgets and goals for spending and saving. So that you can easily manage your financial budgets.
uz: 'CASH FLOW moliyaviy menejeringizga xush kelibsiz. Ushbu ilova yordamida, birinchi navbatda, siz o'z xarajatlaringiz va daromadlaringizni osongina qo'shishingiz, shuningdek, sarflash va tejash uchun byudjet va maqsadlarni yaratishingiz mumkin. Shunday qilib, siz o'zingizning moliyaviy byudjetlaringizni osongina boshqarishingiz mumkin.

# editBtn
source: Edit
uz: O'zgartirish

# totalBalance_Edition
source: Total Balance
uz: Umumiy Balansingiz

# income_Edition
source: Income
uz: Foyda

# expense_Edition
source: Expense
uz: Xarajat

# cancelBtn
source: Cancel
uz: Bekor qilish

# saveChangesBtn
source: Save changes
uz: Saqlash

# exp_Income
source: Expecting Income
uz: Kutilayotgan Foyda

source: Money Transfer
uz: Pul O'tkazmasi

source: Books
uz: Kitoblar

source: Rent
uz: Ijara haqi

source: Car Payment
uz: Avtomobil harajatlari

source: Education
uz: Ta'lim

# food
source: Grocery Shopping
uz: Oziq-ovqat

source: Health Care
uz: Salomatlik

source: Salary
uz: Ish haqi

source: Taxes
uz: Soliqlar

# netflixSubs
source: Netflix Subscription
uz: Netflix a'zolik

source: Travel
uz: Sayohat

# transportation
source: Transportation Fee
uz: Yo'l haqi

source: Activity
uz: Mashg'ulot

source: Entertainment
uz: O'yin-kulgu

source: Shopping
uz: Bozorlik qilish

source: Hair Cut
uz: Soch oldirish

source: Tools
uz: Asbob-anjomlar

# title9
source: Currency Converter
uz: Valyuta ayrboshlash

# amount_placeholder
source: Enter amount
uz: Miqdorni kiriting
